In [1]:
import pandas as pd

In [15]:
import numpy as np

1. Series (1D data/single column)
2. DataFrame (2D Data/Multi-column/Tabular)
3. Panel (3D Data/Multi-table)

In [3]:
s1 = pd.Series([])
s1

<ipython-input-3-6dd875829415>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1 = pd.Series([])

Series([], dtype: float64)

In [4]:
s2 = pd.Series([3,65,3,6,7,2,7,378,94,6,7])
s2

0       3
1      65
2       3
3       6
4       7
5       2
6       7
7     378
8      94
9       6
10      7
dtype: int64

In [5]:
type(s2)

pandas.core.series.Series

In [6]:
print(s2)

0       3
1      65
2       3
3       6
4       7
5       2
6       7
7     378
8      94
9       6
10      7
dtype: int64

In [7]:
len(s2)

11

In [8]:
s2.dtype

dtype('int64')

In [9]:
s2.shape

(11,)

In [10]:
s2.ndim

1

In [11]:
s2.size

11

In [21]:
s3 = pd.Series((34,5,3,78,4,8,45))
s3

0    34
1     5
2     3
3    78
4     4
5     8
6    45
dtype: int64

In [22]:
pd.Series({'a':45,'b':436,'c':34,'d':99})

a     45
b    436
c     34
d     99
dtype: int64

In [23]:
s4 = pd.Series({'a':'go','b':'nice','c':'fdg'})
s4

a      go
b    nice
c     fdg
dtype: object

In [24]:
pd.Series(np.array([4,6,3,78,3,8]))

0     4
1     6
2     3
3    78
4     3
5     8
dtype: int32

In [25]:
pd.Series([[345,46,263],[568,37,9435]])

0     [345, 46, 263]
1    [568, 37, 9435]
dtype: object

In [26]:
list('abcdefghijklmn')

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n']

In [27]:
s5 = pd.Series([34,68,345,768,32,6,57,34,68,38,452,45,45,76], index=list('abcdefghijklmn'))
s5

a     34
b     68
c    345
d    768
e     32
f      6
g     57
h     34
i     68
j     38
k    452
l     45
m     45
n     76
dtype: int64

In [29]:
s2[4]

7

In [30]:
s5['m']

45

In [31]:
s2[3:9]

3      6
4      7
5      2
6      7
7    378
8     94
dtype: int64

In [32]:
s5[3:8]

d    768
e     32
f      6
g     57
h     34
dtype: int64

In [33]:
s2.value_counts()

7      3
3      2
6      2
65     1
2      1
378    1
94     1
dtype: int64

In [35]:
s2.sort_values()

5       2
0       3
2       3
3       6
9       6
4       7
6       7
10      7
1      65
8      94
7     378
dtype: int64

In [36]:
s2.max()

378

In [37]:
s2.min()

2

In [38]:
s2.idxmin()

5

In [39]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [40]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [41]:
type(df)

pandas.core.frame.DataFrame

In [42]:
len(df)

0

In [43]:
df1 = pd.DataFrame([4,63,6,36,3,78,4,67,43,678])
df1

     0
0    4
1   63
2    6
3   36
4    3
5   78
6    4
7   67
8   43
9  678

In [44]:
df2 = pd.DataFrame([[4,63],[6,36],[3,78],[4,67],[43,678]])
df2

    0    1
0   4   63
1   6   36
2   3   78
3   4   67
4  43  678

In [46]:
# df3 = pd.DataFrame({'a':4,'b':5,'c':65})
df3 = pd.DataFrame({'a':[4],'b':[5],'c':[65]})
df3

   a  b   c
0  4  5  65

In [48]:
{'a':[4,10,13,43,5,2,56,46],'b':[5,10,13,43,5,2,46],'c':[65,10,13,43,5,2,56,46]}

{'a': [4, 10, 13, 43, 5, 2, 56, 46],
 'b': [5, 10, 13, 43, 5, 2, 46],
 'c': [65, 10, 13, 43, 5, 2, 56, 46]}

In [50]:
df4 = pd.DataFrame({'a':[4,10,13,43,5,2,56,46],'b':[5,10,13,43,5,36,2,46],'c':[65,10,13,43,5,2,56,46]})
df4

    a   b   c
0   4   5  65
1  10  10  10
2  13  13  13
3  43  43  43
4   5   5   5
5   2  36   2
6  56   2  56
7  46  46  46

In [53]:
df5 = pd.DataFrame([[4,63],[6,36],[3,78],[4,67],[43,678]], columns=['Value','Parameter'], index=['ab','bc','cd','de','ef'])
df5

    Value  Parameter
ab      4         63
bc      6         36
cd      3         78
de      4         67
ef     43        678

In [54]:
df5['Value']

ab     4
bc     6
cd     3
de     4
ef    43
Name: Value, dtype: int64

In [55]:
df2[0]

0     4
1     6
2     3
3     4
4    43
Name: 0, dtype: int64

In [56]:
df2

    0    1
0   4   63
1   6   36
2   3   78
3   4   67
4  43  678

In [57]:
df2.loc[0]

0     4
1    63
Name: 0, dtype: int64

In [58]:
type(df2[0])

pandas.core.series.Series

In [59]:
df2[[0,1]]

    0    1
0   4   63
1   6   36
2   3   78
3   4   67
4  43  678

In [60]:
df5[['Value','Parameter']]

    Value  Parameter
ab      4         63
bc      6         36
cd      3         78
de      4         67
ef     43        678

In [61]:
df5[['Value']]

    Value
ab      4
bc      6
cd      3
de      4
ef     43

In [62]:
df5['Value']

ab     4
bc     6
cd     3
de     4
ef    43
Name: Value, dtype: int64

In [63]:
# Logical Indexing

In [64]:
df5

    Value  Parameter
ab      4         63
bc      6         36
cd      3         78
de      4         67
ef     43        678

In [68]:
df5['Parameter'][[True,True,False,False,True]]

ab     63
bc     36
ef    678
Name: Parameter, dtype: int64

In [69]:
df5['Parameter']>70

ab    False
bc    False
cd     True
de    False
ef     True
Name: Parameter, dtype: bool

In [70]:
df5[df5['Parameter']>70]

    Value  Parameter
cd      3         78
ef     43        678

In [71]:
df5['Parameter'][df5['Parameter']>70]

cd     78
ef    678
Name: Parameter, dtype: int64